Repository: landersanmi/Capital-Bikeshare-Forecaster
Catalog: MapVisualizer_server/swagger_server/translations/*/LC_MESSAGES/messages.po
Languages: es, eu

# ERROR_STATION_INFO
source: An error happened loading stations data, check DB server connection.
es: Error al cargar la información de las estaciones, comprobar el servidor de la BD.
eu: Errorea estazioetako informazioa kargatzean, egiaztatu datu-basearen zerbitzaria.

# ERROR_STATIONS
source: An error happened loading stations, check DB server connection.
es: Error al cargar las estaciones, comprobar el servidor de la BD.
eu: Errorea estazioak kargatzean, egiaztatu datu-basearen zerbitzaria.

# ERROR_STATION
source: Error loading the station, provide an existing one.
es: Error al cargar la estación, introduce una existente.
eu: Errorea estazioa kargatzean, sartu existitzen den bat.

# ERROR_PREDICTIONS
source: An error happened loading predictions, probably Forecaster or DB server are inactive.
es: Error al cargar las predicciones, puede que el servidor Forecaster o la BD estén inactivos.
eu: Errorea iragarpenak kargatzean, baliteke Forecaster edo datu-basearen zerbitzariak aktibo ez egotea.

# ERROR_SYSTEM_INFO
source: Error loading the information about the Capital Bikeshare system.
es: Error al cargar la información sobre el sistema Capital Bikeshare.
eu: Errorea Capital Bikeshare sistemari buruzko informazioa kargatzean.

source: Date
es: Fecha
eu: Data

source: Station
es: Estación
eu: Geltokia

# ERROR_ACTUAL_DAY
source: Error loading real data of selected date, check DB connection.
es: Error al cargar los datos reales del día actual, comprobar el servidor de la BD.
eu: Errorea egungo eguneko datu errealak kargatzean, egiaztatu datu-basearen zerbitzaria.

# ERROR_LAST_WEEK
source: Error loading real data of last week, check DB connection.
es: Error al cargar los datos reales de la semana pasada, comprobar el servidor de la BD.
eu: Errorea joan den asteko datu errealak kargatzean, egiaztatu datu-basearen zerbitzaria.

source: Docks
es: Anclajes
eu: Ainguraleku

# RENTALS_FORECAST_AXIS_LABEL
source: Forecasted rentals
es: Predicción de alquileres
eu: Alokairuen iragarpena

# RENTALS_REAL_AXIS_LABEL
source: Real rentals
es: Alquileres reales
eu: Benetako alokairuak

# RENTALS_TITLE
source: Rentals | Forecast & Real
es: Alquileres | Predicciones & Real
eu: Alokairuak | Iragarpenak eta Benetakoak

source: Rentals
es: Alquileres
eu: Alokairuak

# RETURNS_FORECAST_AXIS_LABEL
source: Forecasted returns
es: Predicción de devoluciones
eu: Itzulketen iragarpena

# RETURNS_REAL_AXIS_LABEL
source: Real returns
es: Devoluciones reales
eu: Benetako itzulpenak

# RETURNS_TITLE
source: Returns | Forecast & Real
es: Devoluciones | Predicciones & Real
eu: Itzulpenak | Iragarpenak eta Benetakoak

source: Returns
es: Devoluciones
eu: Itzulpenak

# AVAILABILITY_FORECAST_AXIS_LABEL
source: Forecasted availability
es: Predicción de disponibilidad
eu: Erabilgarritasunaren iragarpena

# AVAILABILITY_REAL_AXIS_LABEL
source: Real availability
es: Disponibilidad real
eu: Benetako erabilgarritasuna

# AVAILABILITY_TITLE
source: Availability | Forecast & Real
es: Disponibilidad | Predicciones & Real
eu: Erabilgarritasna | Iragarpenak eta Benetakoak

source: Availability
es: Disponibilidad
eu: Erabilgarritasuna

# LASTWEEK_RENTALS_AXIS_LABEL
source: Last week rentals
es: Alquileres semana pasada
eu: Alokairuak joan den astean

# LASTWEEK_RETURNS_AXIS_LABEL
source: Last week returns
es: Devoluciones semana pasada
eu: Itzulpenak joan den astean

# LASTWEEK_TITLE
source: Rentals & Returns | Last week
es: Alquileres & Devoluciones | Semana pasada
eu: Alokairuak eta Itzulpenak | Joan den astea

source: Last week
es: Semana Pasada
eu: Joan den astea

# ENABLE_JS
source: You need to enable JavaScript to run Capital Bikeshare Forecaster.
es: Es necesario activar JavaScript para visualizar Capital Bikeshare Forecaster correctamente.
eu: JavaScript aktibatu behar duzu Capital Bikeshare Forecaster egoki ikusteko.

# SELECT_STATION
source: Select a station...
es: Selecciona una estación...
eu: Geltoki bat aukeratu...

# SEARCH-SELECT
source: Search or select
es: Buscar o seleccionar
eu: Bilatu edo aukeratu

# SELECT_DATE
source: Select a day...
es: Selecciona un día...
eu: Egun bat aukeratu...

source: Email
es: Correo electrónico
eu: Posta elektronikoa

source: Phone
es: N.º Teléfono
eu: Telefono zenbakia

source: Start date
es: Fecha de comienzo
eu: Hasiera-data

source: Timezone
es: Zona horaria
eu: Ordu zona
